org/_posts/2025-11-08-python-cell-filter-test.org
#+TITLE: Python Cell Filter Test
#+DATE: 2025-11-08
#+AUTHOR: Author
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: python
#+JEKYLL_TAGS: pyodide python-cell matplotlib test

This post demonstrates the new org-mode filters for python-cell blocks that automatically generate interactive Pyodide cells.

* Regular Python Cells

Here is a simple Python calculation using the new ~python-cell~ syntax:

#+begin_src python-cell
2 + 2
#+end_src

Another example with variables:

#+begin_src python-cell
x = 5
y = 10
x * y + 7
#+end_src

Let's try something with a list comprehension:

#+begin_src python-cell
sum([i**2 for i in range(10)])
#+end_src

* Python Cells with Sympy

Now let's test symbolic mathematics with Sympy:

#+begin_src python-cell
import sympy as sp
x = sp.symbols('x')
expr = sp.expand((x + 2)**3)
expr
#+end_src

Another symbolic calculation - integration:

#+begin_src python-cell
import sympy as sp
x = sp.symbols('x')
sp.integrate(sp.sin(x), x)
#+end_src

* Matplotlib Cells

The filter automatically detects matplotlib usage and generates appropriate HTML for image output.

Here's a simple plot:

#+begin_src python-cell
import matplotlib.pyplot as plt
import numpy as np

x = np.linspace(0, 2*np.pi, 100)
y = np.sin(x)

plt.plot(x, y)
plt.title("Sine Wave")
plt.xlabel("x")
plt.ylabel("sin(x)")
plt.grid(True)
plt.show()
#+end_src

A more complex plot with multiple curves:

#+begin_src python-cell
import matplotlib.pyplot as plt
import numpy as np

x = np.linspace(0, 2*np.pi, 100)

plt.plot(x, np.sin(x), label='sin(x)')
plt.plot(x, np.cos(x), label='cos(x)')
plt.plot(x, np.sin(x)**2, label='sin²(x)', linestyle='--')

plt.title("Trigonometric Functions")
plt.xlabel("x")
plt.ylabel("y")
plt.legend()
plt.grid(True)
plt.show()
#+end_src

A scatter plot example:

#+begin_src python-cell
import matplotlib.pyplot as plt
import numpy as np

np.random.seed(42)
x = np.random.randn(50)
y = np.random.randn(50)
colors = np.random.rand(50)
sizes = 1000 * np.random.rand(50)

plt.scatter(x, y, c=colors, s=sizes, alpha=0.6, cmap='viridis')
plt.colorbar()
plt.title("Random Scatter Plot")
plt.xlabel("X-axis")
plt.ylabel("Y-axis")
plt.show()
#+end_src

* Testing the Feature

The new filter automatically:
- Detects ~#+begin_src python-cell~ blocks
- Generates unique IDs for each cell
- Creates appropriate HTML with textarea, button, and output area
- Detects matplotlib usage and generates image-based output
- Detects sympy usage and loads the sympy package
- Initializes Pyodide only once per page
- Loads required packages (matplotlib, numpy, sympy) as needed

This makes it much easier to create interactive Python content without manually writing all the HTML and JavaScript!

A math test to ensure other features still work: \(e^{i\pi} + 1 = 0\).
